# GetDefaultHookAngle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..GetDefaultHookAngle Method
RebarShape Class See Also
---
Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int GetDefaultHookAngle(
	int index
)
```

Visual Basic
---
```text
Public Function GetDefaultHookAngle ( _
	index As Integer _
) As Integer
```

Visual C++
---
```text
public:
int GetDefaultHookAngle(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 0 for the starting hook, 1 for the ending hook.
# Remarks
Replaces the method GetHookAngle() from prior releases.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index must be 0 or 1. |

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace